pandas series

In [2]:
import pandas as pd

In [3]:
# creating a series from list
# observe that s list of values is provided 
myseries = pd.Series([10, 20, 30])

print(myseries)

0    10
1    20
2    30
dtype: int64

In [4]:
# Creating a custom-index Series
myseries = pd.Series(
     [10,20,30], 
     index = ["a","b","c"]
)

print(myseries)
print(myseries['a'])

a    10
b    20
c    30
dtype: int64
10

In [5]:
# Accessing an item in a Series
myseries = pd.Series(
   ["Jane","John","Emily","Matt"]
)

# Print the first item
print(myseries[0])

Jane

In [6]:
# Checking if all the values are unique  ==> basically know whether there is some duplicate in series
# is_unique method on the series
myseries = pd.Series([1,2,3])
print(myseries.is_unique)

myseries = pd.Series([1,1,3])
print(myseries.is_unique)

True
False

pandas dataframe

In [7]:
df = pd.DataFrame({
    "Name": ["Jane", "John", "Matt", "Ashley"],
    "Age": [24, 21, 26, 32]
}, index=['a','b','c','d'])

print(df)

     Name  Age
a    Jane   24
b    John   21
c    Matt   26
d  Ashley   32

In [8]:
# Dictionary keys become the column names and the values become the data stored in the DataFrame. 
# We now have a DataFrame with two columns and four rows. 
# We can check the dimensions of a DataFrame using the shape method that returns a tuple containing the number of rows and columns.
print(df.shape)

(4, 2)

Creating a dafarame from different files has methods like read_sql, read_csv, read_json, read_parquet, read_excel

In [9]:
sales_df = pd.read_csv('sales.csv')
# now the data might be very large and I want to see only top 5 rows I can use head function
# also notice that head() is the method 
# whereas shape is a property that means pandas class must have a attribute of shape
print(sales_df.head())
print(sales_df.shape)

   product_code product_group  stock_qty    cost    price  last_week_sales  \
0          4187           PG2        498  420.76   569.91               13
1          4195           PG2        473  545.64   712.41               16
2          4204           PG2        968  640.42   854.91               22
3          4219           PG2        241  869.69  1034.55               14
4          4718           PG2       1401   12.54    26.59               50

   last_month_sales
0                58
1                58
2                88
3                45
4               285
(1000, 7)

In [10]:
# the file might have a lot of columns but i just want to read a few of them what to do???
# usecols argument
sales_col_df = pd.read_csv("sales.csv", usecols=["product_code","product_group","stock_qty"])
print(sales_col_df.head())
print(sales_col_df.shape)

   product_code product_group  stock_qty
0          4187           PG2        498
1          4195           PG2        473
2          4204           PG2        968
3          4219           PG2        241
4          4718           PG2       1401
(1000, 3)

In [11]:
# now you see i restricted the columns I want to load in df, what about rows
# can i somehow retrict the number of rows I am reading??
# nrows
sales_rows_cols_df = pd.read_csv("sales.csv", usecols=["product_code","product_group","stock_qty"], nrows=10)
print(sales_rows_cols_df.head())
print(sales_rows_cols_df.shape)

   product_code product_group  stock_qty
0          4187           PG2        498
1          4195           PG2        473
2          4204           PG2        968
3          4219           PG2        241
4          4718           PG2       1401
(10, 3)

Create a dataframe python dictionary or 2-d array

In [12]:
# pd.DataFrame construcotr to create using dictionary
df = pd.DataFrame({
  "Names": ["Jane", "John", "Matt", "Ashley"],
  "Ages": [26, 24, 28, 25],
  "Score": [91.2, 94.1, 89.5, 92.3]
})

print(df)

    Names  Ages  Score
0    Jane    26   91.2
1    John    24   94.1
2    Matt    28   89.5
3  Ashley    25   92.3

In [13]:
import numpy as np
arr = np.random.randint(10, 20, size=(3,5))
df = pd.DataFrame(arr, columns=["A","B","C","D","E"])
print(arr)
print(df)

[[13 16 18 19 15]
 [19 18 19 16 11]
 [10 13 12 11 19]]
    A   B   C   D   E
0  13  16  18  19  15
1  19  18  19  16  11
2  10  13  12  11  19

##  Exploring a dataframe

#### 1. size of a dataframe (The size, shape, and len methods) # see all these are attributes

In [14]:
sales = pd.read_csv("sales.csv")
# shape gives a tuple telling rows and columns
print("shape:",sales.shape)
# size gives the number of columns * number of roes
print("size:",sales.size)
# len gives number of rows
print("len:",len(sales))

shape: (1000, 7)
size: 7000
len: 1000

#### 2. Data Types of Columns

In [15]:
# Data structures of different data types take up a different amount of memory space. 
# Having proper data types saves us from wasting memory.

# Some methods and functions can also be used with certain data types. 
# For instance, we need to store data that contains date and time in the data structures of datetime data type to use it.
### dtypes property to see the data types of the df
sales = pd.read_csv("sales.csv")

print(sales.dtypes)

product_code          int64
product_group        object
stock_qty             int64
cost                float64
price               float64
last_week_sales       int64
last_month_sales      int64
dtype: object

In [16]:
 # Column property returns the columns as an index, 
 # but we can convert it to a list with the help of the list function.
 
sales = pd.read_csv("sales.csv")

print("As index:")
print(sales.columns)

print("As list:")
print(list(sales.columns))

As index:
Index(['product_code', 'product_group', 'stock_qty', 'cost', 'price',
       'last_week_sales', 'last_month_sales'],
      dtype='object')
As list:
['product_code', 'product_group', 'stock_qty', 'cost', 'price', 'last_week_sales', 'last_month_sales']

In [17]:
# The data type of the stock quantity column is an integer. 
# Suppose we have some products whose stock amount can be a decimal point number. 
# For instance, we might have 125.2 kg of rice.

# We can use the astpye function to change the data types of columns.
### astype mthod
sales = pd.read_csv("sales.csv")

sales["stock_qty"] = sales["stock_qty"].astype("float")

print(sales.dtypes)

product_code          int64
product_group        object
stock_qty           float64
cost                float64
price               float64
last_week_sales       int64
last_month_sales      int64
dtype: object

In [18]:
# The astype function also accepts a dictionary, so we can change the data type of multiple columns in a single operation. 
# The dictionary keys indicate that the column name and values are the new data types.

sales = pd.read_csv("sales.csv")

sales = sales.astype({
  "stock_qty": "float",
  "last_week_sales": "float"
})

print(sales.dtypes)

product_code          int64
product_group        object
stock_qty           float64
cost                float64
price               float64
last_week_sales     float64
last_month_sales      int64
dtype: object

In [19]:
# Using the unique and nunique functions
# The nunique function returns the number of distinct values in a column 
# and the unique function actually shows the unique values.
sales = pd.read_csv("sales.csv")
print(sales["product_group"])
print(sales["product_group"].nunique())
print(sales["product_group"].unique())

0      PG2
1      PG2
2      PG2
3      PG2
4      PG2
      ...
995    PG4
996    PG4
997    PG2
998    PG2
999    PG5
Name: product_group, Length: 1000, dtype: object
6
['PG2' 'PG4' 'PG6' 'PG5' 'PG3' 'PG1']

In [20]:
# unique is giving me unique values and nunique gives me count of unique. 
# I need to get which unique comes how many times. ==> use value_counts
print(sales["product_group"].value_counts())

PG4    349
PG5    255
PG6    243
PG2     75
PG3     39
PG1     39
Name: product_group, dtype: int64

##MEAN, MODE, MEDIAN (CENTRAL TENDENCY)

In [21]:
# median on series
myseries = pd.Series([1, 2, 5, 7, 11, 36])
print(myseries.median())

6.0

In [22]:
# mode on a series (mode is returning series of number which are the mode in series eg. 6 and 11 here)
myseries = pd.Series([1, 4, 6, 6, 6, 11, 11,11, 24])
print(f"The mode of my series is {myseries.mode()}")
print(f"The mode of my series is {myseries.mode()[1]}")

The mode of my series is 0     6
1    11
dtype: int64
The mode of my series is 11

In [23]:
# min, max and mean, mode and median
print("mean: ")
print(sales["price"].mean())

print("median: ")
print(sales["price"].median())

print("mode: ")
print(sales["price"].mode()[0])

print("minimum: ")
print(sales["price"].min())

print("maximum: ")
print(sales["price"].max())

mean:
67.06351000000001
median:
23.74
mode:
10.44
minimum:
0.66
maximum:
1500.05

In [24]:
# variance and standard deviation 
print("variance: ")
print(sales["price"].var())

print("standard deviation: ")
print(sales["price"].std())

variance:
20766.243824604506
standard deviation:
144.10497501684148

In [25]:
print(sales["price"])
print(sales["product_code"].value_counts())
print(type(sales["product_code"].value_counts()))
print(sales["product_code"].value_counts().index[:3].to_list())
print(list(sales["product_code"].value_counts().values))

0       569.91
1       712.41
2       854.91
3      1034.55
4        26.59
        ...
995      11.39
996       3.32
997      61.74
998      42.74
999      18.99
Name: price, Length: 1000, dtype: float64
5694    3
2591    2
2645    2
1942    2
5990    2
       ..
4936    1
1313    1
9739    1
9767    1
3018    1
Name: product_code, Length: 953, dtype: int64
<class 'pandas.core.series.Series'>
[5694, 2591, 2645]
[3, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]

In [26]:
x = sales["product_code"].value_counts().index.tolist()
x[:3]

[5694, 2591, 2645]

## Filtering the dataframe

In [27]:
# The main difference between them is the way they access rows and columns:

# loc uses row and column labels.
# iloc uses row and column indexes.

sales = pd.read_csv("sales.csv")
sales.head()

,product_code,product_group,stock_qty,cost,price,last_week_sales,last_month_sales
0,4187,PG2,498,420.76,569.91,13,58
1,4195,PG2,473,545.64,712.41,16,58
2,4204,PG2,968,640.42,854.91,22,88
3,4219,PG2,241,869.69,1034.55,14,45
4,4718,PG2,1401,12.54,26.59,50,285

In [28]:
sales[["product_group","product_code","stock_qty"]]

    product_group  product_code  stock_qty
0             PG2          4187        498
1             PG2          4195        473
2             PG2          4204        968
3             PG2          4219        241
4             PG2          4718       1401
..            ...           ...        ...
995           PG4          8048        415
996           PG4          8050        -10
997           PG2           952       5388
998           PG2          1307      44996
999           PG5          3018       1697

[1000 rows x 3 columns]

In [29]:
sales[:5]

,product_code,product_group,stock_qty,cost,price,last_week_sales,last_month_sales
0,4187,PG2,498,420.76,569.91,13,58
1,4195,PG2,473,545.64,712.41,16,58
2,4204,PG2,968,640.42,854.91,22,88
3,4219,PG2,241,869.69,1034.55,14,45
4,4718,PG2,1401,12.54,26.59,50,285

In [30]:
sales.loc[:4]

,product_code,product_group,stock_qty,cost,price,last_week_sales,last_month_sales
0,4187,PG2,498,420.76,569.91,13,58
1,4195,PG2,473,545.64,712.41,16,58
2,4204,PG2,968,640.42,854.91,22,88
3,4219,PG2,241,869.69,1034.55,14,45
4,4718,PG2,1401,12.54,26.59,50,285

In [31]:
# loc is looking at the column name 
sales.loc[:4,["product_group","product_code","stock_qty"]]

  product_group  product_code  stock_qty
0           PG2          4187        498
1           PG2          4195        473
2           PG2          4204        968
3           PG2          4219        241
4           PG2          4718       1401

In [32]:
# above thing with iloc only used the indexes
sales.iloc[:5,[1,0,2]]

  product_group  product_code  stock_qty
0           PG2          4187        498
1           PG2          4195        473
2           PG2          4204        968
3           PG2          4219        241
4           PG2          4718       1401

In [33]:
# Get rows from row. no 6 to 9 and initial 2 columns
print(sales.iloc[[5,6,7,8], [0,1]])

   product_code product_group
5          5630           PG4
6          5631           PG4
7          5634           PG4
8          2650           PG4

In [34]:
print(sales.iloc[5:9, :2])

   product_code product_group
5          5630           PG4
6          5631           PG4
7          5634           PG4
8          2650           PG4

Pandas assigns integer labels to rows by default. Unless we specify otherwise, row indexes and labels will be the same.

In [35]:
df = pd.DataFrame(
  np.random.randint(10, size=(4,4)),
  index = ["a","b","c","d"],
  columns = ["col_a","col_b","col_c","col_d"]
  )

print(df)

print("\nSelect two rows and two columns using loc:")
print(df.loc[["b","d"], ["col_a","col_c"]])

   col_a  col_b  col_c  col_d
a      7      4      1      5
b      2      7      7      1
c      5      9      2      9
d      4      8      2      4

Select two rows and two columns using loc:
   col_a  col_c
b      2      7
d      4      2

In [36]:
print("\nSelect two rows and two columns using iloc:")
print(df.iloc[[1,3], [0,2]])

Select two rows and two columns using iloc:
   col_a  col_c
b      2      7
d      4      2

# Selecting a subset of columns

In [37]:
sales = pd.read_csv("sales.csv")

selected_columns = ["product_code","price"]

print(sales[selected_columns].head())
# or
print(sales[["product_code","price"]].head())

   product_code    price
0          4187   569.91
1          4195   712.41
2          4204   854.91
3          4219  1034.55
4          4718    26.59
   product_code    price
0          4187   569.91
1          4195   712.41
2          4204   854.91
3          4219  1034.55
4          4718    26.59

In [38]:
#pandas expect list otherwise error, see here
# print(sales["product_code","price"].head())

In [39]:
# Even if we want to select only one column, we need to put it in a list.
# Otherwise, Pandas will return a Series instead of a DataFrame with one column.
print(sales["product_code"][:2],type(sales["product_code"]))
print(sales[["product_code"]][:2],type(sales[["product_code"]]))

0    4187
1    4195
Name: product_code, dtype: int64 <class 'pandas.core.series.Series'>
   product_code
0          4187
1          4195 <class 'pandas.core.frame.DataFrame'>

##Filtering by Condition

In [40]:
# The following line of code selects the products that belong to product group PG2.
sales_filtered = sales[sales.product_group == "PG2"]
sales_filtered.head()

,product_code,product_group,stock_qty,cost,price,last_week_sales,last_month_sales
0,4187,PG2,498,420.76,569.91,13,58
1,4195,PG2,473,545.64,712.41,16,58
2,4204,PG2,968,640.42,854.91,22,88
3,4219,PG2,241,869.69,1034.55,14,45
4,4718,PG2,1401,12.54,26.59,50,285

In [41]:
sales_PG1_filtered = sales[sales["product_group"] == "PG2"]
sales_PG1_filtered.head()

,product_code,product_group,stock_qty,cost,price,last_week_sales,last_month_sales
0,4187,PG2,498,420.76,569.91,13,58
1,4195,PG2,473,545.64,712.41,16,58
2,4204,PG2,968,640.42,854.91,22,88
3,4219,PG2,241,869.69,1034.55,14,45
4,4718,PG2,1401,12.54,26.59,50,285

In [42]:
# We can use any of the options above, unless thereâ€™s a space in the column name.
# In such cases, the first option wonâ€™t work.

In [43]:
sales_numeric_filtered = sales[sales["price"] > 100]
sales_numeric_filtered.head()
# The operators we can use to create conditions are:

# ==: equal
# !=: not equal
# >: greater than
# >=: greater than or equal to
# <: less than
# <=: less than or equal to

,product_code,product_group,stock_qty,cost,price,last_week_sales,last_month_sales
0,4187,PG2,498,420.76,569.91,13,58
1,4195,PG2,473,545.64,712.41,16,58
2,4204,PG2,968,640.42,854.91,22,88
3,4219,PG2,241,869.69,1034.55,14,45
8,2650,PG4,239,59.40,111.06,15,38

In [44]:
# Multiple conditions
# filter the sales data frame # logical and here
sales_filtered = sales[(sales["price"] > 100) & (sales["stock_qty"] < 400)]

print(sales_filtered[["price","stock_qty"]].head())

       price  stock_qty
3    1034.55        241
8     111.06        239
165   208.91        244
186   427.41        369
199   104.49        144

When combining multiple conditions, make sure to put each filter inside parentheses. 
Otherwise, a value error will be generated.

In [45]:
# The | operator is used to combine multiple conditions with OR logic.
sales_filtered = sales[(sales["product_group"] == "PG1") | (sales["product_group"] == "PG2")]
sales_filtered.head()

,product_code,product_group,stock_qty,cost,price,last_week_sales,last_month_sales
0,4187,PG2,498,420.76,569.91,13,58
1,4195,PG2,473,545.64,712.41,16,58
2,4204,PG2,968,640.42,854.91,22,88
3,4219,PG2,241,869.69,1034.55,14,45
4,4718,PG2,1401,12.54,26.59,50,285

In [46]:
# The isin method
# Thereâ€™s a more practical option, which is the isin method. It accepts a list of values used for filtering.
sales_filtered = sales[sales["product_group"].isin(["PG1","PG2","PG3"])]
print(sales_filtered[["product_code","product_group"]].head())

   product_code product_group
0          4187           PG2
1          4195           PG2
2          4204           PG2
3          4219           PG2
4          4718           PG2

In [47]:
# Finally, we have the not operator (~). Itâ€™s used before the name of the DataFrame inside the square brackets.
# We can select the products that arenâ€™t in product groups PG1, PG2, or PG3 as follows:

sales_filtered = sales[~sales["product_group"].isin(["PG1","PG2","PG3"])]
print(sales_filtered[["product_group"]].head())
print(sales_filtered["product_group"].value_counts())

  product_group
5           PG4
6           PG4
7           PG4
8           PG4
9           PG4
PG4    349
PG5    255
PG6    243
Name: product_group, dtype: int64

#The query function

In [48]:
# It differs from previous functions because it can write the conditions as text. 
# Itâ€™s quite useful and is more practical in various cases.

sales_filtered = sales.query("price > 100")
sales_filtered.head()

,product_code,product_group,stock_qty,cost,price,last_week_sales,last_month_sales
0,4187,PG2,498,420.76,569.91,13,58
1,4195,PG2,473,545.64,712.41,16,58
2,4204,PG2,968,640.42,854.91,22,88
3,4219,PG2,241,869.69,1034.55,14,45
8,2650,PG4,239,59.40,111.06,15,38

In [49]:
# multiple conditions with query
sales_filtered = sales.query("price > 100 and stock_qty < 400")

print(sales_filtered[["product_code","price","stock_qty"]].head())

     product_code    price  stock_qty
3            4219  1034.55        241
8            2650   111.06        239
165          1657   208.91        244
186          7269   427.41        369
199          3530   104.49        144

In [50]:
# be extra careful if writing another string
sales_filtered = sales.query("product_group == 'PG2'")
print(sales_filtered.head())

   product_code product_group  stock_qty    cost    price  last_week_sales  \
0          4187           PG2        498  420.76   569.91               13
1          4195           PG2        473  545.64   712.41               16
2          4204           PG2        968  640.42   854.91               22
3          4219           PG2        241  869.69  1034.55               14
4          4718           PG2       1401   12.54    26.59               50

   last_month_sales
0                58
1                58
2                88
3                45
4               285

Slicing and Indexing on Strings

In [51]:
staff = pd.read_csv("staff.csv")

In [52]:
print(staff.head())
print(staff.shape)
print(staff.columns)

               name             city date_of_birth  start_date   salary  \
0          John Doe      Houston, TX    1998-11-04  2018-08-11  $65,000
1          Jane Doe     San Jose, CA    1995-08-05  2017-08-24  $70,000
2        Matt smith       Dallas, TX    1996-11-25  2020-04-16  $58,500
3     Ashley Harris        Miami, FL    1995-01-08  2021-02-11  $49,500
4  Jonathan targett  Santa Clara, CA    1998-08-14  2020-09-01  $62,000

        department
0       Accounting
1    Field Quality
2  human resources
3       accounting
4    field quality
(6, 6)
Index(['name', 'city', 'date_of_birth', 'start_date', 'salary', 'department'], dtype='object')

Selecting the first character of strings

In [53]:
# A string is a sequence of characters, so each character has an associated index.
# The indexes of characters can be used to select an individual character or a slice from a string.
# For instance, we can get the first letter of the strings in the name column as below:
print(staff["name"].str[0])

0    J
1    J
2    M
3    A
4    J
5    H
Name: name, dtype: object

In [54]:
# slicing the initial 3 letters (notice here that 3 is out)
print(staff["name"].str[0:3])
# or
print(staff["name"].str[:3])

0    Joh
1    Jan
2    Mat
3    Ash
4    Jon
5    Hal
Name: name, dtype: object
0    Joh
1    Jan
2    Mat
3    Ash
4    Jon
5    Hal
Name: name, dtype: object

In [55]:
print(staff["name"].str[-2:])

0    oe
1    oe
2    th
3    is
4    tt
5    le
Name: name, dtype: object

In [56]:
# For instance, we can create a slice that involves every other character, starting from the second-to-last index.
# str[start : end : step size]
print(staff["name"].str[1::2])

0        onDe
1        aeDe
2       atsih
3      slyHri
4    oahntret
5        aeCl
Name: name, dtype: object

Splitting and Combining Strings

In [57]:
print(staff)

               name             city date_of_birth  start_date   salary  \
0          John Doe      Houston, TX    1998-11-04  2018-08-11  $65,000
1          Jane Doe     San Jose, CA    1995-08-05  2017-08-24  $70,000
2        Matt smith       Dallas, TX    1996-11-25  2020-04-16  $58,500
3     Ashley Harris        Miami, FL    1995-01-08  2021-02-11  $49,500
4  Jonathan targett  Santa Clara, CA    1998-08-14  2020-09-01  $62,000
5         Hale Cole      Atlanta, GA    2000-10-24  2021-10-20  $54,500

        department
0       Accounting
1    Field Quality
2  human resources
3       accounting
4    field quality
5      engineering

In [58]:
# The Pandas split function is available under the str accessor. 
# It splits a string at the position of the given character and then returns a list of all parts.
print(staff["name"].str.split(" "))

0            [John, Doe]
1            [Jane, Doe]
2          [Matt, smith]
3       [Ashley, Harris]
4    [Jonathan, targett]
5           [Hale, Cole]
Name: name, dtype: object

In [59]:
# Itâ€™s not enough to merely split a string. We also need to extract the part we need.
# The expand parameter of the split function can be used to create separate columns after splitting. 
# We can then select the column we need.
from copy import deepcopy
staff_exp = deepcopy(staff)
staff_exp["last_name"] = staff_exp["name"].str.split(" ", expand=True)[1]
print(staff_exp)

               name             city date_of_birth  start_date   salary  \
0          John Doe      Houston, TX    1998-11-04  2018-08-11  $65,000
1          Jane Doe     San Jose, CA    1995-08-05  2017-08-24  $70,000
2        Matt smith       Dallas, TX    1996-11-25  2020-04-16  $58,500
3     Ashley Harris        Miami, FL    1995-01-08  2021-02-11  $49,500
4  Jonathan targett  Santa Clara, CA    1998-08-14  2020-09-01  $62,000
5         Hale Cole      Atlanta, GA    2000-10-24  2021-10-20  $54,500

        department last_name
0       Accounting       Doe
1    Field Quality       Doe
2  human resources     smith
3       accounting    Harris
4    field quality   targett
5      engineering      Cole

In [60]:
# Combining
print(staff["name"] + " - " + staff["department"])

0               John Doe - Accounting
1            Jane Doe - Field Quality
2        Matt smith - human resources
3          Ashley Harris - accounting
4    Jonathan targett - field quality
5             Hale Cole - engineering
dtype: object

Converting Strings to Upper and Lower Case

In [61]:
print("--b4 applying lower--")
print(staff_exp[["name"]])
staff_exp["name_lower"] = staff_exp["name"].str.lower()
staff_exp["name_upper"] = staff_exp["name"].str.upper()
staff_exp["dept_capitalize"] = staff_exp["department"].str.capitalize()
print("--after applying lower--")
print(staff_exp[["name","name_lower","name_upper","dept_capitalize"]])

--b4 applying lower--
               name
0          John Doe
1          Jane Doe
2        Matt smith
3     Ashley Harris
4  Jonathan targett
5         Hale Cole
--after applying lower--
               name        name_lower        name_upper  dept_capitalize
0          John Doe          john doe          JOHN DOE       Accounting
1          Jane Doe          jane doe          JANE DOE    Field quality
2        Matt smith        matt smith        MATT SMITH  Human resources
3     Ashley Harris     ashley harris     ASHLEY HARRIS       Accounting
4  Jonathan targett  jonathan targett  JONATHAN TARGETT    Field quality
5         Hale Cole         hale cole         HALE COLE      Engineering

In [62]:
# applying lower or upper on single string
print(staff_exp["department"][0].upper())

ACCOUNTING

When we work on tabular data (data in tables), 
itâ€™s much more efficient to use the string methods under the str accessor. 
They allow us to perform operations on the entire column. 
Make sure to write str` before the name of the method.

In [63]:
# Replacing Characters in a String
staff = pd.read_csv("staff.csv")
print(staff["city"])
print(staff["city"].str.replace(",", "-"))
print(staff["city"])

0        Houston, TX
1       San Jose, CA
2         Dallas, TX
3          Miami, FL
4    Santa Clara, CA
5        Atlanta, GA
Name: city, dtype: object
0        Houston- TX
1       San Jose- CA
2         Dallas- TX
3          Miami- FL
4    Santa Clara- CA
5        Atlanta- GA
Name: city, dtype: object
0        Houston, TX
1       San Jose, CA
2         Dallas, TX
3          Miami, FL
4    Santa Clara, CA
5        Atlanta, GA
Name: city, dtype: object

In [64]:
# previously we replaced one column values, what if I want to replace it in entire df
# answer is direct replace method
staff = pd.read_csv("staff.csv")

# Create a state colum
staff["state"] = staff["city"].str[-2:]
print(staff["state"])
# Replace state abbreviations with actual state names
staff["state"].replace(
    {"TX": "Texas", "CA": "California", "FL": "Florida", "GA": "Georgia"},
    inplace = True
)

print(staff["state"])

0    TX
1    CA
2    TX
3    FL
4    CA
5    GA
Name: state, dtype: object
0         Texas
1    California
2         Texas
3       Florida
4    California
5       Georgia
Name: state, dtype: object

The inplace parameter is set to True to save changes in the DataFrame.

Itâ€™s important to emphasize the difference between str.replace and DataFrame.replace:

str.replace can be used to replace a part of a string. We can replace one character, multiple characters, or the entire string.
DataFrame.replace can be used to replace the entire value. We can also use this function to replace values with other data types such as integer and boolean.

In [65]:
# Combining multiple operations
# we can extract the state part from the city column and convert it to lowercase letters in a single line of code.
print(staff["city"].str.split(",", expand=True)[1].str.lower())
# Consider a case where we need to change the name of the â€œfield qualityâ€ department to â€œqualityâ€.
# In the department column of the staff, there are both lower and upper case letters.
# We first need to convert them to either lower or upper case and then do the replacement.
print(staff["department"].str.lower().replace("field quality","quality"))

0     tx
1     ca
2     tx
3     fl
4     ca
5     ga
Name: 1, dtype: object
0         accounting
1            quality
2    human resources
3         accounting
4            quality
5        engineering
Name: department, dtype: object

In [66]:
# filtering operation with the query function, extracts the year from the start_date column,
# and changes its data type to integer.
print(staff[["name","start_date"]])
print(staff.query("name > 'John Doe'").start_date.str[:4].astype("int"))

               name  start_date
0          John Doe  2018-08-11
1          Jane Doe  2017-08-24
2        Matt smith  2020-04-16
3     Ashley Harris  2021-02-11
4  Jonathan targett  2020-09-01
5         Hale Cole  2021-10-20
2    2020
4    2020
Name: start_date, dtype: int32

In [67]:
print(staff["salary"])
staff["salary_cleaned"] = staff["salary"].str[1:].str.replace(",","")
staff["salary_cleaned"] = staff["salary_cleaned"].astype("int")
# return list(staff["salary_cleaned"])
print(staff["salary_cleaned"])

0    $65,000
1    $70,000
2    $58,500
3    $49,500
4    $62,000
5    $54,500
Name: salary, dtype: object
0    65000
1    70000
2    58500
3    49500
4    62000
5    54500
Name: salary_cleaned, dtype: int32

DateTime [The datetime64[ns] data type can be used to express date and time values. The values that have datetime64[ns]data type are calledTimestamp. A Timestampcontains both date and time information. We can convert a string representing a date to a Timestamp by using theto_datetime` constructor.]

In [68]:
mydate = pd.to_datetime("2021-11-10")
print(mydate)

2021-11-10 00:00:00

In [69]:
# Another commonly used data type with dates and times is timedelta[ns]
# which is used for representing the difference between two datetime objects.
first_date = pd.to_datetime("2021-10-10")
second_date = pd.to_datetime("2021-10-02")
diff = first_date - second_date

print(diff)
print(diff.days)

8 days 00:00:00
8

In [70]:
# staff df has 2 columns date_of_birth and start_date with these info. Use astype
# initial reading is object, lets convert them to datetime
staff = staff.astype({"date_of_birth":"datetime64[ns]","start_date":"datetime64[ns]",})
print(staff.dtypes)

name                      object
city                      object
date_of_birth     datetime64[ns]
start_date        datetime64[ns]
salary                    object
department                object
state                     object
salary_cleaned             int32
dtype: object

the attributes

In [71]:

mydate = pd.to_datetime("2021-10-10")

print(f"The year part is {mydate.year}")
print(f"The month part is {mydate.month}")
print(f"The week number part is {mydate.week}")
print(f"The day part is {mydate.day}")

The year part is 2021
The month part is 10
The week number part is 40
The day part is 10

In [72]:
mydate = pd.to_datetime("2021-10-10 14:30:00")
# time related information
print(f"The hour part of mydate is {mydate.hour}")
print(f"The minute part of mydate is {mydate.minute}")
print(f"The second part of mydate is {mydate.second}")

The hour part of mydate is 14
The minute part of mydate is 30
The second part of mydate is 0

methods

In [73]:
# The date method gives us the date part of a Timestamp object. We can also get the name of the month, the name of the day, and the day of the week.


mydate = pd.to_datetime("2021-12-21 00:00:00")

print(f"The date part is {mydate.date()}")
print(f"The day of week is {mydate.weekday()}")
print(f"The name of the month is {mydate.month_name()}")
print(f"The name of the day is {mydate.day_name()}")

The date part is 2021-12-21
The day of week is 1
The name of the month is December
The name of the day is Tuesday

In [74]:
# In most cases, we donâ€™t work with single values but with data stored in a DataFrame. 
# A typical DataFrame of transactional sales at a retail store might contain millions of rows.

# read DataFrame
staff = pd.read_csv("staff.csv")

# change the data type of date columns
staff = staff.astype({
    "date_of_birth": "datetime64[ns]",
    "start_date": "datetime64[ns]",
})

# create start_month column
staff["start_month"] = staff["start_date"].dt.month

print(staff)

               name             city date_of_birth start_date   salary  \
0          John Doe      Houston, TX    1998-11-04 2018-08-11  $65,000
1          Jane Doe     San Jose, CA    1995-08-05 2017-08-24  $70,000
2        Matt smith       Dallas, TX    1996-11-25 2020-04-16  $58,500
3     Ashley Harris        Miami, FL    1995-01-08 2021-02-11  $49,500
4  Jonathan targett  Santa Clara, CA    1998-08-14 2020-09-01  $62,000
5         Hale Cole      Atlanta, GA    2000-10-24 2021-10-20  $54,500

        department  start_month
0       Accounting            8
1    Field Quality            8
2  human resources            4
3       accounting            2
4    field quality            9
5      engineering           10

In [75]:
# We can get the year and dayparts using the year and day in a similar way. 
# Some other methods available through the dt accessor are:

# weekday
# hour
# minute
# second

staff["start_date"].dt.isocalendar()

   year  week  day
0  2018    32    6
1  2017    34    4
2  2020    16    4
3  2021     6    4
4  2020    36    2
5  2021    42    3

The DateOffset function

In [76]:
# Consider a case where we want to give a raise to our employees one year after theyâ€™re hired.
# In the staff, we can create a column called raise_date by adding one year to the 
# start_date column.

# create the DataFrame
staff = pd.read_csv("staff.csv")

# change the date type
staff = staff.astype({
    "date_of_birth": "datetime64[ns]",
    "start_date": "datetime64[ns]"
})

# create raise_date column
staff["raise_date"] = staff["start_date"] + pd.DateOffset(years=1)
staff["months"] = staff["start_date"] + pd.DateOffset(months=6)

print(staff[["start_date","raise_date", "months"]].head())

  start_date raise_date     months
0 2018-08-11 2019-08-11 2019-02-11
1 2017-08-24 2018-08-24 2018-02-24
2 2020-04-16 2021-04-16 2020-10-16
3 2021-02-11 2022-02-11 2021-08-11
4 2020-09-01 2021-09-01 2021-03-01

The units that can be used in the DataOffset function are:

years
months
weeks
days
hours
minutes
seconds
microseconds
nanoseconds

In [77]:
# 2 methods of subtraction
mytime = pd.Timestamp("2021-12-14 16:50:00") 

print("The first method")
print(mytime + pd.DateOffset(hours=-2))

print("\nThe second method")
print(mytime - pd.DateOffset(hours=2))

The first method
2021-12-14 14:50:00

The second method
2021-12-14 14:50:00

In [78]:
# Another function to do same thing is TimeDelta but it does not support year, month units
# W and w represent a week
# D and d represent a day
# H and h represent an hour
# T and t represent a minute
# S and s represent a second
# L and l represent a millisecond
# U and u represent a microsecond
# N and n represent a nanosecond

In [79]:
# create the DataFrame
staff = pd.read_csv("staff.csv")

# change the date type
staff = staff.astype({
    "date_of_birth": "datetime64[ns]",
    "start_date": "datetime64[ns]"
})

# add 12 weeks
print(staff["start_date"] + pd.Timedelta(value=12, unit="W"))

0   2018-11-03
1   2017-11-16
2   2020-07-09
3   2021-05-06
4   2020-11-24
5   2022-01-12
Name: start_date, dtype: datetime64[ns]

In [80]:
# One nice feature of the Timedelta function is that it accepts strings for
# specifying the duration to be added or subtracted. 
# To use this format, both the value and unit are written as a single string. 
# We simply need to write the unit, as with the unit parameter. 
# Letâ€™s do the same example as above but with a string.

# add 12 weeks
print(staff["start_date"] + pd.Timedelta("12 W"))

0   2018-11-03
1   2017-11-16
2   2020-07-09
3   2021-05-06
4   2020-11-24
5   2022-01-12
Name: start_date, dtype: datetime64[ns]

# Handling Missing Values With Pandas

### pd.Int64Dtype() to ensure that a column's datatype remains integer even if there is a missing value

NaN = standard missing value representation in a dataframe 
But there is a problem, that NaN is incompatible with integers, so integers are by default upgraded to float in these case. 
Catch is that there is a solution to ensure rest of the coumn remains integer type 
We need to explicitly declare the data type as pd.Int64Dtype(). 
Learn through example below:-

In [81]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    "A": [1, 2, 3, np.nan],
    "B": [2.4, 6.2, 5.1, np.nan],
    "C": ["foo","zoo","bar", np.nan]
})

print(df)

     A    B    C
0  1.0  2.4  foo
1  2.0  6.2  zoo
2  3.0  5.1  bar
3  NaN  NaN  NaN

the values in column A are converted to float because of the missing value in the last row. If we change the data type of this column to pd.Int64Dtype(), the values will be integers.

In [82]:
df = pd.DataFrame({
    "A": [1, 2, 3, np.nan],
    "B": [2.4, 6.2, 5.1, np.nan],
    "C": ["foo","zoo","bar", np.nan]
})

df["A"] = df["A"].astype(pd.Int64Dtype())
print(df)

      A    B    C
0     1  2.4  foo
1     2  6.2  zoo
2     3  5.1  bar
3  <NA>  NaN  NaN

### The isna and notna functions

isna() - evaluate every cell return True if it is missing value otherwise it returns false 
notna() - evaluate every cell return True if value is present and returns False if value is missing.

In [83]:
# df to use 

df = pd.DataFrame({
    "A": [1, 2, 3, np.nan, 7],
    "B": [2.4, np.nan, 5.1, np.nan, 2.6],
    "C": [np.nan, "foo","zoo","bar", np.nan],
    "D": [11.5, np.nan, 6.2, 21.1, 8.7]
})

In [88]:
print(df.isna())
print(df.notna())

       A      B      C      D
0  False  False   True  False
1  False   True  False   True
2  False  False  False  False
3   True   True  False  False
4  False  False   True  False
       A      B      C      D
0   True   True  False   True
1   True  False   True  False
2   True   True   True   True
3  False  False   True   True
4   True   True  False   True

 See in actual working, the dataframes are very large we can actually not do any of the stuff to see all cells. So it's way to handle is by doing complete rowwise, columnwise or dataframewise operation.
 columnwise total missing value, apply sum. rowwise total missing value, apply sum but mention that axis is 1 meaning apply rowwise. if u want to apply total then do it sum after sum, either on rows calculated or the columns.

In [89]:
# columnwise total missing value, apply sum 
print(df.isna().sum())
print(df.notna().sum())

A    1
B    2
C    2
D    1
dtype: int64
A    4
B    3
C    3
D    4
dtype: int64

In [90]:
# rowwise total missing value, apply sum but mention that axis is 1 meaning apply rowwise
print(df.isna().sum(axis=1))
print(df.notna().sum(axis=1))

0    1
1    2
2    0
3    2
4    1
dtype: int64
0    3
1    2
2    4
3    2
4    3
dtype: int64

In [91]:
# if u want to apply total then do it sum after sum, either on rows calculated or the columns
print(df.isna().sum().sum())
print(df.isna().sum(axis=1).sum())
print(df.notna().sum().sum())
print(df.notna().sum(axis=1).sum())

6
6
14
14

### Dropping Rows and Columns with Missing Values

##### The dropna function
##### parameters :-
##### 1. axis (by default axis is 0, which means rows)
##### 2. how (2 possible values any or all, default is any) any - drop a row or column if atleast 1 value miss. all - drop only if all values in that column/row are missed.
##### 3. thresh (minimum values that should be present in that column/row to prevent it from drop)
##### 4. The inplace parameter (inplace=True) to save changes in that dataframe.

In [94]:
df = pd.DataFrame({
    "A": [1, 2, 3, np.nan, 7],
    "B": [2.4, np.nan, 5.1, np.nan, 2.6],
    "C": [np.nan, "foo","zoo","bar", np.nan],
    "D": [11.5, np.nan, 6.2, 21.1, 8.7],
    "E": [1, 2, 3, 4, 5]
})
print(df)

     A    B    C     D  E
0  1.0  2.4  NaN  11.5  1
1  2.0  NaN  foo   NaN  2
2  3.0  5.1  zoo   6.2  3
3  NaN  NaN  bar  21.1  4
4  7.0  2.6  NaN   8.7  5

In [95]:
# Drop rows that have at least one missing value
print(df.dropna(axis=0, how="any"))

     A    B    C    D  E
2  3.0  5.1  zoo  6.2  3

In [96]:
# Drop columns that have at least one missing value
print(df.dropna(axis=1, how="any"))

   E
0  1
1  2
2  3
3  4
4  5

Another important parameter of the dropna function is thresh, which can set a threshold value for dropping. For instance, if we set the thresh parameter to 4, a row must have at least four non-missing values to not be dropped. In other words, the rows with two or more missing values will be dropped because there are five columns in the DataFrame.

In [98]:
# Drop rows that have less than 4 non-missing values
print(df.dropna(thresh=4))

     A    B    C     D  E
0  1.0  2.4  NaN  11.5  1
2  3.0  5.1  zoo   6.2  3
4  7.0  2.6  NaN   8.7  5

In [99]:
# without in place
df.dropna(thresh=4)
print(df)

     A    B    C     D  E
0  1.0  2.4  NaN  11.5  1
1  2.0  NaN  foo   NaN  2
2  3.0  5.1  zoo   6.2  3
3  NaN  NaN  bar  21.1  4
4  7.0  2.6  NaN   8.7  5

In [100]:
# with in place 
df.dropna(thresh=4,inplace=True)
print(df)

     A    B    C     D  E
0  1.0  2.4  NaN  11.5  1
2  3.0  5.1  zoo   6.2  3
4  7.0  2.6  NaN   8.7  5

### Replacing the Missing Values

##### The fillna function
##### fillna actually fills the missing values with the values specified through this.
##### 2 mthods available for fillna 1.bfill 2. ffill
##### inplace is also supported here.

In [101]:
df = pd.DataFrame({
    "A": [1, 2, 3, np.nan, 7],
    "B": [2.4, np.nan, 5.1, np.nan, 2.6],
    "C": [np.nan, "foo","zoo","bar", np.nan],
    "D": [11.5, np.nan, 6.2, 21.1, 8.7],
    "E": [1, 2, 3, 4, 5]
})
print(df)

     A    B    C     D  E
0  1.0  2.4  NaN  11.5  1
1  2.0  NaN  foo   NaN  2
2  3.0  5.1  zoo   6.2  3
3  NaN  NaN  bar  21.1  4
4  7.0  2.6  NaN   8.7  5

In [102]:
# filling the missing value with the average of the column
print(df["A"].fillna(value = df["A"].mean()))

0    1.00
1    2.00
2    3.00
3    3.25
4    7.00
Name: A, dtype: float64

In [103]:
# using dictionary to fill more the one column in df
# find the replacement values
value_a = df["A"].mean()
value_d = df["D"].mean()

# replace the missing values
print(df.fillna({"A": value_a, "D": value_d}))

      A    B    C       D  E
0  1.00  2.4  NaN  11.500  1
1  2.00  NaN  foo  11.875  2
2  3.00  5.1  zoo   6.200  3
3  3.25  NaN  bar  21.100  4
4  7.00  2.6  NaN   8.700  5

In [104]:

print("Filling backward")
print(df["A"].fillna(method="bfill"))

print("\nFilling forward")
print(df["A"].fillna(method="ffill"))

Filling backward
0    1.0
1    2.0
2    3.0
3    7.0
4    7.0
Name: A, dtype: float64

Filling forward
0    1.0
1    2.0
2    3.0
3    3.0
4    7.0
Name: A, dtype: float64

In [106]:
# we can control the bfill and ffill through limit to prevent the chaining
df = pd.DataFrame({
    "A": [1, 2, np.nan, np.nan, 8]
})

print("Without the limit parameter")
print(df.fillna(method="bfill"))

print("\nWith the limit parameter")
print(df.fillna(method="bfill", limit=1))

Without the limit parameter
     A
0  1.0
1  2.0
2  8.0
3  8.0
4  8.0

With the limit parameter
     A
0  1.0
1  2.0
2  NaN
3  8.0
4  8.0

In [114]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    "Date": pd.date_range(start="2021-10-01", periods=10),
    "Measurement": [16, 13, 14, 12, np.nan, np.nan, np.nan, 8, 7, 5]
})


df.fillna(method="bfill", limit=2, inplace=True)
df["Measurement"] = df["Measurement"].fillna(value=df["Measurement"].mean())
print(list(df["Measurement"]))

[16.0, 13.0, 14.0, 12.0, 10.11111111111111, 8.0, 8.0, 8.0, 7.0, 5.0]